# âœ…Deep-in-Net: Network Architecture Simulation

## ğŸ“š PrÃ©sentation
Ce projet illustre la simulation de plusieurs topologies de rÃ©seau Ã  l'aide de Cisco Packet Tracer. L'objectif est d'explorer le sous-rÃ©seautage, l'adressage IP, les principes de base de la commutation et du routage, ainsi que la conception de rÃ©seaux Ã  l'aide de commutateurs et de concentrateurs.


### 1. Topologies point Ã  point
3 connexions point Ã  point distinctes

Chaque connexion comprend deux PC connectÃ©s via Ethernet

#### Exemple d'adresses IPÂ :

192.168.1.3/24 (pc0) --> 192.168.1.4/24 (pc1)

192.168.13.82/29 (pc2) --> 192.168.13.83/29 (pc3)

192.168.13.254/29 (pc4) --> 192.168.13.253/29 (pc5)

ğŸ”§ TÃ¢ches rÃ©alisÃ©esÂ :
Assignation d'adresses IP statiques

Validation du sous-rÃ©seau

Test ping entre les appareils

## ğŸš€ Ã‰tapes pour recrÃ©er le projet (ex01.pkt)
Ouvrez Cisco Packet Tracer

CrÃ©ez les topologiesÂ :
Utilisez Â«Â TerminauxÂ Â» > Â«Â PC-PTÂ Â» pour les PC

Connectez les pÃ©riphÃ©riques Ã  l'aide des cÃ¢bles appropriÃ©sÂ :

PC â†” PCÂ : CÃ¢ble croisÃ©

Attribuez les adresses IP manuellement on click sous Â«Â PCÂ > BureauÂ > Configuration IPÂ Â»

Utilisez l'invite de commande pour tester la connectivitÃ© avec une commande ping

## 2. Topologies LAN
#### ğŸŸ¦ LAN basÃ© sur un commutateur
5 PC connectÃ©s Ã  un commutateur

Sous-rÃ©seauÂ : 192.168.1.0/29

#### ğŸŸ© LAN basÃ© sur un concentrateur
5 PC connectÃ©s Ã  un concentrateur

Sous-rÃ©seauÂ : 192.168.1.193/27

#### ğŸ”§ TÃ¢ches effectuÃ©esÂ :
Configuration IP pour tous les clients (comme dans ex01.pkt)

Connexion via des cÃ¢bles appropriÃ©s (directs)


Test de connectivitÃ© par ping

### ğŸ“ RÃ©sumÃ© du sous-rÃ©seau
PrÃ©fixe de sous-rÃ©seau HÃ´tes Plage Appareils utilisÃ©s : <br />
192.168.1.0 /24 192.168.1.1 â€“ 192.168.1.254 2 PC <br />
192.168.1.192 /27 192.168.1.193 â€“ 192.168.1.222 5 PC

## ğŸš€ Ã‰tapes pour recrÃ©er le projet (ex02.pkt)
Ouvrez Cisco Packet Tracer

CrÃ©ez les topologiesÂ :

Utilisez Â«Â End devicesÂ Â» > Â«Â PC-PTÂ Â» pour les PC 

Utilisez Â«Â Network devicesÂ Â» > Â« switches Â»  pour les switch 2960

Utilisez Â«Â Network devicesÂ Â» > Â« Hubs Â»  pour le PT-Hub

PC â†” Commutateur/ConcentrateurÂ : CÃ¢ble droit

Attribuez les adresses IP manuellement on click sous Â«Â PCÂ > BureauÂ > Configuration IPÂ Â»

lan 1 (switch)

pc0 192.168.1.1/29 <br>
pc1 192.168.1.2/29 <br>
pc2 192.168.1.3/29 <br>
pc3 192.168.1.4/29 <br>
pc4 192.168.1.5/29 <br>

lan 2 (hub)

pc5 192.168.1.193/27 <br>
pc6 192.168.1.194/27 <br>
pc7 192.168.1.195/27 <br>
pc8 192.168.1.196/27 <br>
pc9 192.168.1.197/27 <br>


## 3 ğŸŒ Topologies Serveurs et RÃ©seau centralisÃ©
Cette partie du projet simule un rÃ©seau d'entreprise avec un rack de serveurs, connectÃ© Ã  plusieurs postes clients via un commutateur (switch).

# ğŸ–¥ï¸ Disposition des Ã©quipements
## ğŸ—„ï¸ Serveurs (dans le rack)
HTTPS Server â€“ IP : 192.168.1.99

FTP Server â€“ IP : 192.168.1.100

DNS Server â€“ IP : 192.168.1.101

DHCP Server â€“ 192.168.1.102 (attribue dynamiquement)

## ğŸ’» Clients (PC0 â†’ PC5)
ConnectÃ©s via le Switch 2950

Exemple dâ€™adresse statique attribuÃ©e : 192.168.1.7/24

## ğŸ”§ TÃ¢ches effectuÃ©es
Configuration statique des serveurs

Configuration dynamique (DHCP) ou statique des PC selon le scÃ©nario

Connexions via cÃ¢bles directs (straight-through)

Tests de connectivitÃ© via ping

Configuration DNS (selon le scÃ©nario)

Test d'accÃ¨s aux services :

FTP (ftp://192.168.1.100)

HTTPS (https://192.168.1.99)

DNS (https://192.168.1.101)

DHCP (https://192.168.1.102)

RÃ©solution DNS (avec le serveur 192.168.1.101)

## ğŸ“ Adressage IP utilisÃ©
Appareil	Adresse IP	RÃ´le
HTTPS Server	192.168.1.99	Serveur web sÃ©curisÃ© <br>
FTP Server	192.168.1.100	Transfert de fichiers <br>
DNS Server	192.168.1.101	RÃ©solution de noms <br>
DHCP Server	192.168.1.102	Attribution dâ€™adresses <br>
PC0 â†’ PC5	192.168.1.X/24	Postes clients

## â„¹ï¸ Le masque utilisÃ© est /24, permettant jusquâ€™Ã  254 hÃ´tes valides.

## ğŸš€ Ã‰tapes pour recrÃ©er ce scÃ©nario (ex03.pkt)
Ouvrez Cisco Packet Tracer

Placez :

4 serveurs (Server-PT) depuis End Devices

6 PC (PC-PT)

1 switch (2960)

Connectez tous les Ã©quipements via des cÃ¢bles directs

Configurez :

Les serveurs avec des IP statiques

Les PC avec IP statique ou DHCP (selon configuration)

Configurez les services sur chaque serveur (via Services dans le menu des serveurs)

Testez les services depuis les clients :

Pings

FTP/HTTPS

RÃ©solution DNS

# 4 .ğŸ”  Topologies de Routage Point-Ã -Point avec Routeur

Ce scÃ©nario illustre un exemple simple de routage entre deux rÃ©seaux Ã  lâ€™aide dâ€™un routeur Cisco 1841, avec deux PC sur des sous-rÃ©seaux sÃ©parÃ©s.

---

## ğŸ–¥ï¸ Ã‰quipements et Adressage

| Ã‰quipement | Type     | Adresse IP        | Masque           | RÃ´le                     |
|------------|----------|-------------------|------------------|--------------------------|
| PC0        | PC-PT    | 192.168.1.2       | 255.255.255.252  | HÃ´te dans sous-rÃ©seau 1 |
| PC1        | PC-PT    | 192.168.2.2       | 255.255.255.252  | HÃ´te dans sous-rÃ©seau 2 |
| Routeur    | 1841     | - Interfaces IP Ã  configurer - | - | Pont entre les deux rÃ©seaux |

---

## ğŸ“ DÃ©tails IP

- **PC0** â†’ rÃ©seau `192.168.1.0/30`
  - IP : `192.168.1.2`
  - Masque : `255.255.255.252`
  - Passerelle : ex. `192.168.1.1`

- **PC1** â†’ rÃ©seau `192.168.2.0/30`
  - IP : `192.168.2.2`
  - Masque : `255.255.255.252`
  - Passerelle : ex. `192.168.2.1`

---

## âš™ï¸ Ã‰tapes de configuration

1. **Configurer les interfaces du routeur :**

   ```bash
   Router> enable
   Router# configure terminal

   # Interface vers PC0
   Router(config)# interface fastethernet0/0
   Router(config-if)# ip address 192.168.1.1 255.255.255.252
   Router(config-if)# no shutdown

   # Interface vers PC1
   Router(config)# interface fastethernet0/1
   Router(config-if)# ip address 192.168.2.1 255.255.255.252
   Router(config-if)# no shutdown

2. **Configurer les passerelles sur les PC** :

PC0 : Gateway â†’ 192.168.1.1

PC1 : Gateway â†’ 192.168.2.1

3. **Tester la connectivitÃ©** :

Depuis PC0 : ping 192.168.2.2

Depuis PC1 : ping 192.168.1.2


# 5 ğŸ§­ Toplogie Routage Inter-VLAN avec Sous-RÃ©seaux Distincts

Ce scÃ©nario reprÃ©sente une infrastructure rÃ©seau segmentÃ©e en deux sous-rÃ©seaux distincts, interconnectÃ©s via un **routeur central (Cisco 2911)**. Chaque sous-rÃ©seau est reliÃ© Ã  un switch, avec plusieurs hÃ´tes (PC-PT) dans chaque segment.

---

## ğŸ§© Structure du RÃ©seau

### ğŸ”€ Routeur
- **ModÃ¨le :** Cisco 2911
- **RÃ´le :** Interconnexion des sous-rÃ©seaux (routage)

### ğŸ” Switchs
- 2 Switchs (Switch0 et Switch1) pour chaque sous-rÃ©seau

---

## ğŸŒ Sous-rÃ©seaux & Adressage IP

### ğŸ§± Sous-RÃ©seau A
- **Adresse rÃ©seau :** `192.168.1.0/29`
- **Plage IP utilisable :** `192.168.1.1 â€“ 192.168.1.6`
- **Passerelle (routeur) :** `192.168.1.1` (interface vers Switch0)
- **HÃ´tes connectÃ©s :** PC0 Ã  PC4

### ğŸ§± Sous-RÃ©seau B
- **Adresse rÃ©seau :** `192.168.1.192/27`
- **Plage IP utilisable :** `192.168.1.193 â€“ 192.168.1.222`
- **Passerelle (routeur) :** `192.168.1.193` (interface vers Switch1)
- **HÃ´tes connectÃ©s :** PC5 Ã  PC9

---

## ğŸ–¥ï¸ Tableau des Appareils

| Appareil | Type   | IP Adresse          | Sous-RÃ©seau        |
|----------|--------|---------------------|--------------------|
| PC1-5    | PC-PT  | 192.168.1.2 Ã  .6    | 192.168.1.0/29     |
| PC6-10   | PC-PT  | 192.168.1.194 .198      | 192.168.1.192/27   |
| Router0  | Cisco 2911 | 192.168.1.1 / .193 | Interfaces Fa0/0, Fa0/1 |
| Switch0  | Switch | ---                 | ConnectÃ© Ã  PC0-4   |
| Switch1  | Switch | ---                 | ConnectÃ© Ã  PC4-9  |

---

## âš™ï¸ Ã‰tapes de Configuration

### 1. Interfaces du Routeur
```bash
Router> enable
Router# configure terminal

# Interface vers Sous-RÃ©seau A
Router(config)# interface fastethernet0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.248
Router(config-if)# no shutdown

# Interface vers Sous-RÃ©seau B
Router(config)# interface fastethernet0/1
Router(config-if)# ip address 192.168.1.193 255.255.255.224
Router(config-if)# no shutdown
```


# 6 ğŸŒ Topologie Routage entre deux LAN via deux routeurs

Ce scÃ©nario reprÃ©sente deux rÃ©seaux locaux (LAN) connectÃ©s via un lien point-Ã -point entre deux routeurs. Chaque LAN contient un PC configurÃ© avec une adresse IP statique.

---

## ğŸ“Œ DÃ©tails des Ã‰quipements

| Ã‰quipement   | Type       | IP Adresse       | Masque             | RÃ´le                   |
|--------------|------------|------------------|---------------------|------------------------|
| PC1          | PC-PT      | 192.168.1.2       | 255.255.255.0      | HÃ´te LAN 1             |
| PC2          | PC-PT      | 192.168.2.2       | 255.255.255.0      | HÃ´te LAN 2             |
| Router1      | Router-PT  | 192.168.1.1 (LAN) | 255.255.255.0      | Passerelle de PC1      |
|              |            | 10.10.0.1 (WAN)   | 255.255.255.252    | Vers Router2           |
| Router2      | Router-PT  | 192.168.2.1 (LAN) | 255.255.255.0      | Passerelle de PC2      |
|              |            | 10.10.0.2 (WAN)   | 255.255.255.252    | Vers Router1           |

---

## ğŸ“ Sous-rÃ©seaux

- **LAN 1** : `192.168.1.0/24`
  - HÃ´te : `192.168.1.2`
  - Gateway : `192.168.1.1`

- **LAN 2** : `192.168.2.0/24`
  - HÃ´te : `192.168.2.2`
  - Gateway : `192.168.2.1`

- **Lien WAN** : `10.10.0.0/30`
  - Router1 : `10.10.0.1`
  - Router2 : `10.10.0.2`

---

## âš™ï¸ Ã‰tapes de Configuration

### Routeur 1
```bash
Router1> enable
Router1# configure terminal

# Interface LAN
Router1(config)# interface fastethernet0/0
Router1(config-if)# ip address 192.168.1.1 255.255.255.0
Router1(config-if)# no shutdown

# Interface WAN
Router1(config)# interface serial0/0/0
Router1(config-if)# ip address 10.10.0.1 255.255.255.252
Router1(config-if)# no shutdown

# Route statique vers LAN 2
Router1(config)# ip route 192.168.2.0 255.255.255.0 10.10.0.2

```


### Router 2

```bash
Router2> enable
Router2# configure terminal

# Interface LAN
Router2(config)# interface fastethernet0/0
Router2(config-if)# ip address 192.168.2.1 255.255.255.0
Router2(config-if)# no shutdown

# Interface WAN
Router2(config)# interface serial0/0/0
Router2(config-if)# ip address 10.10.0.2 255.255.255.252
Router2(config-if)# no shutdown

# Route statique vers LAN 1
Router2(config)# ip route 192.168.1.0 255.255.255.0 10.10.0.1
```

# 7 ğŸŒ Topologie Routage entre deux LAN via deux routeurs et deux switchs

Ce scÃ©nario reprÃ©sente deux rÃ©seaux locaux (LAN) avec des post connecter a un swith connectÃ©s via un lien point-Ã -point entre deux routeurs. Chaque LAN contient 5 et 4 PC configurÃ© avec une adresse IP statique.

---

## ğŸ“Œ DÃ©tails des Ã‰quipements

| Ã‰quipement   | Type       | IP Adresse       | Masque             | RÃ´le                   |
|--------------|------------|------------------|---------------------|------------------------|
| PC1          | PC-PT      | 192.168.1.2       | 255.255.255.0      | HÃ´te LAN 1             |
| PC2          | PC-PT      | 192.168.1.3       | 255.255.255.0      | HÃ´te LAN 1             |
| PC3          | PC-PT      | 192.168.1.4       | 255.255.255.0      | HÃ´te LAN 1             |
| PC4          | PC-PT      | 192.168.1.5       | 255.255.255.0      | HÃ´te LAN 1             |
| PC5          | PC-PT      | 192.168.1.6       | 255.255.255.0      | HÃ´te LAN 1             |
| laptop0      | Laptoppt-PT| 192.168.2.2       | 255.255.255.0      | HÃ´te LAN 2             |
| PC2          | PC-PT      | 192.168.2.3       | 255.255.255.0      | HÃ´te LAN 2             |
| PC2          | PC-PT      | 192.168.2.4       | 255.255.255.0      | HÃ´te LAN 2             |
| PC2          | PC-PT      | 192.168.2.5       | 255.255.255.0      | HÃ´te LAN 2             |
| Router1      | Router-PT  | 192.168.1.1 (LAN) | 255.255.255.0      | Passerelle de PC1-5    |
|              |            | 10.10.0.1 (WAN)   | 255.255.255.252    | Vers Router2           |
| Router2      | Router-PT  | 192.168.2.1 (LAN) | 255.255.255.0      | Passerelle de PC2      |
|              |            | 10.10.0.2 (WAN)   | 255.255.255.252    | Vers Router1           |

---

## ğŸ“ Sous-rÃ©seaux

- **LAN 1** : `192.168.1.0/24`
  - HÃ´te : `192.168.1.2`
  - Gateway : `192.168.1.1`

- **LAN 2** : `192.168.2.0/24`
  - HÃ´te : `192.168.2.2`
  - Gateway : `192.168.2.1`

- **Lien WAN** : `10.10.0.0/30`
  - Router1 : `10.10.0.1`
  - Router2 : `10.10.0.2`

---

## âš™ï¸ Ã‰tapes de Configuration

### Routeur 1
```bash
Router1> enable
Router1# configure terminal

# Interface LAN
Router1(config)# interface fastethernet0/0
Router1(config-if)# ip address 192.168.1.1 255.255.255.0
Router1(config-if)# no shutdown

# Interface WAN
Router1(config)# interface s2/0
Router1(config-if)# ip address 10.10.0.1 255.255.255.252
Router1(config-if)# no shutdown

# Route statique vers LAN 2
Router1(config)# ip route 192.168.2.0 255.255.255.0 10.10.0.2

```


### Router 2

```bash
Router2> enable
Router2# configure terminal

# Interface LAN
Router2(config)# interface fastethernet0/0
Router2(config-if)# ip address 192.168.2.1 255.255.255.0
Router2(config-if)# no shutdown

# Interface WAN
Router2(config)# interface s2/0
Router2(config-if)# ip address 10.10.0.2 255.255.255.252
Router2(config-if)# no shutdown

# Route statique vers LAN 1
Router2(config)# ip route 192.168.1.0 255.255.255.0 10.10.0.1
```


# 7 ğŸŒ Topologie Routage entre deux LAN via deux routeurs et deux switchs

Ce scÃ©nario reprÃ©sente deux rÃ©seaux locaux (LAN) avec des post connecter a un swith connectÃ©s via un lien point-Ã -point entre deux routeurs. Chaque LAN contient 5 et 4 PC configurÃ© avec une adresse IP statique.

---

## ğŸ“Œ DÃ©tails des Ã‰quipements

| Ã‰quipement   | Type       | IP Adresse        | Masque             | RÃ´le                   |
|--------------|------------|-------------------|--------------------|------------------------|
| PC1          | PC-PT      | 192.168.1.194     | 255.255.255.192    | HÃ´te LAN 1             |
| PC2          | PC-PT      | 192.168.1.195     | 255.255.255.192    | HÃ´te LAN 1             |
| PC3          | PC-PT      | 192.168.1.196     | 255.255.255.192    | HÃ´te LAN 1             |
| PC4          | PC-PT      | 192.168.1.197     | 255.255.255.192    | HÃ´te LAN 1             |
| PC5          | PC-PT      | 192.168.1.198     | 255.255.255.192    | HÃ´te LAN 1             |
| laptop0      | Laptoppt-PT| 192.168.2.2       | 255.255.255.0      | HÃ´te LAN 2             |
| PC2          | PC-PT      | 192.168.2.3       | 255.255.255.0      | HÃ´te LAN 2             |
| PC2          | PC-PT      | 192.168.2.4       | 255.255.255.0      | HÃ´te LAN 2             |
| PC2          | PC-PT      | 192.168.2.5       | 255.255.255.0      | HÃ´te LAN 2             |
| PC2          | PC-PT      | 192.168.3.164     | 255.255.255.240    | HÃ´te LAN 3             |
| PC2          | PC-PT      | 192.168.3.165     | 255.255.255.240    | HÃ´te LAN 3             |
| PC2          | PC-PT      | 192.168.3.166     | 255.255.255.240    | HÃ´te LAN 3             |
| Router1      | Router-PT  | 192.168.1.193(LAN)| 255.255.255.0      | Passerelle de PC1-5    |
|              |            | 10.10.0.1 (WAN)   | 255.255.255.252    | Vers Router2           |
| Router2      | Router-PT  | 192.168.2.1 (LAN) | 255.255.255.0      | Passerelle de PC6-9    |
|              |            | 10.10.0.2 (WAN)   | 255.255.255.252    | Vers Router1           |
|              |            | 10.10.1.1 (WAN)   | 255.255.255.252    | Vers Router3           |
| Router3      | Router-PT  | 192.168.3.163(LAN)| 255.255.255.240    | Passerelle de PC10-12  |
|              |            | 10.10.1.2 (WAN)   | 255.255.255.252    | Vers Router2           |

---

## ğŸ“ Sous-rÃ©seaux

- **LAN 1** : `192.168.1.192/26`
  - HÃ´te : `192.168.1.194`
  - Gateway : `192.168.1.193`

- **LAN 2** : `192.168.2.0/24`
  - HÃ´te : `192.168.2.2`
  - Gateway : `192.168.2.1`

  - **LAN 3** : `192.168.3.162/28`
  - HÃ´te : `192.168.3.164`
  - Gateway : `192.168.3.163`

- **Lien WAN** : `10.10.0.0/30`
  - Router1 : `10.10.0.1`
  - Router2 -> Router1 : `10.10.0.2` 
  - Router2 -> Router3 : `10.10.1.1`
  - Router3 : `10.10.1.2`
---

## âš™ï¸ Ã‰tapes de Configuration

### Routeur 1
```bash
Router1> enable
Router1# configure terminal

# Interface LAN
Router1(config)# interface fastethernet0/0
Router1(config-if)# ip address 192.168.1.193 255.255.255.192
Router1(config-if)# no shutdown

# Interface WAN
Router1(config)# interface s2/0
Router1(config-if)# ip address 10.10.0.1 255.255.255.252
Router1(config-if)# no shutdown

# Route statique vers LAN 2 et LAN 3
Router1(config)# ip route 192.168.3.160 255.255.255.240 10.10.0.2 
Router1(config)# ip route 192.168.2.0 255.255.255.0 10.10.0.2 

```


### Router 2

```bash
Router2> enable
Router2# configure terminal

# Interface LAN
Router2(config)# interface fastethernet0/0
Router2(config-if)# ip address 192.168.2.1 255.255.255.0
Router2(config-if)# no shutdown

# Interface WAN 1
Router2(config)# interface s2/0
Router2(config-if)# ip address 10.10.0.2 255.255.255.252
Router2(config-if)# no shutdown

# Interface WAN 2
Router2(config)# interface s3/0
Router2(config-if)# ip address 10.10.1.1 255.255.255.252
Router2(config-if)# no shutdown

# Route statique vers LAN 1 et LAN 3
Router2(config)# ip route 192.168.1.192 255.255.255.192 10.10.0.1 
Router2(config)# ip route 192.168.3.160 255.255.255.240 10.10.1.2
```


### Router 3

```bash
Router3> enable
Router3# configure terminal

# Interface LAN
Router3(config)# interface fastethernet0/0
Router3(config-if)# ip address 192.168.3.163 255.255.255.240
Router3(config-if)# no shutdown

# Interface WAN
Router3(config)# interface s2/0
Router3(config-if)# ip address 10.10.1.2 255.255.255.252
Router3(config-if)# no shutdown

# Route statique vers LAN 1 et LAN 2
Router3(config)# ip route 192.168.1.192 255.255.255.192 10.10.1.1 
Router3(config)# ip route 192.168.2.0 255.255.255.0 10.10.1.1 
```


## ğŸ§  Connaissances acquises (complÃ©tÃ©e)
Principes fondamentaux du sous-rÃ©seautage

Types de cÃ¢bles appropriÃ©s (croisÃ©s/droits)

Adressage IP et comprÃ©hension du binaire

Utilisation de commutateurs (Switches) et de concentrateurs (Hubs)

ConnectivitÃ© de PC Ã  PC

Ã‰viter les conflits d'adresses IP

Configuration de routes statiques entre plusieurs sous-rÃ©seaux

Utilisation de liens point-Ã -point avec un masque /30 (idÃ©al pour les connexions WAN)

ComprÃ©hension de lâ€™adressage IP avancÃ© (ex. : /29, /27, /30)

Gestion des VLAN implicites Ã  travers des switches (mÃªme si non configurÃ©s explicitement)

DÃ©ploiement de services rÃ©seau essentiels : DNS, DHCP, FTP, HTTPS

Utilisation dâ€™un serveur DHCP pour lâ€™attribution automatique dâ€™adresses IP

Configuration et test des services de couche application (FTP, DNS, HTTPS)

Communication inter-rÃ©seaux via des routeurs

VÃ©rification de la connectivitÃ© avec la commande ping et diagnostic de rÃ©seau de base

Topologie en Ã©toile et maillage partiel dans les infrastructures rÃ©seau

Configuration dâ€™une passerelle par dÃ©faut sur les hÃ´tes pour accÃ©der aux autres rÃ©seaux


# ğŸ“‚ Fichiers
deep-in-net/<br />
â”œâ”€â”€ README.md<br />
â”œâ”€â”€ ex01.pkt<br />
â”œâ”€â”€ ex02.pkt<br />
â”œâ”€â”€ ex03.pkt<br />
â”œâ”€â”€ ex04.pkt<br />
â”œâ”€â”€ ex05.pkt<br />
â”œâ”€â”€ ex06.pkt<br />
â”œâ”€â”€ ex07.pkt<br />
â””â”€â”€ ex08.pkt